---
title:  "pandas filtering 데이타"
# categories:
#   - Blog
tags: [python, pandas]

# toc: true
# toc_sticky: true
# toc_label: "페이지 목차"
---

### 데이타프레임 생성

In [13]:
import pandas as pd
df = pd.read_csv("supermarkets.csv")
df.set_index("Address", inplace = True)
df

,ID,City,State,Country,Name,Employees
Address,,,,,,
3666 21st St,1,San Francisco,CA 94114,USA,Madeira,8
735 Dolores St,2,San Francisco,CA 94119,USA,Bready Shop,15
332 Hill St,3,San Francisco,California 94114,USA,Super River,25

### loc 사용법
+ loc는 소괄호()가 아닌 대괄호[]로 감싼다
+ loc의 첫번째는 행에 대한 정보, 두번째는 열에 대한 정보를 입력한다

### df.loc[행 인덱싱값, 열 인덱싱값]

In [14]:
df.loc["735 Dolores St":"332 Hill St", "State":"Country"]

                           State Country
Address
735 Dolores St          CA 94119     USA
332 Hill St     California 94114     USA

### df.loc[행 인덱싱값]

+ 시작과 끝을 슬라이싱으로 지정

In [32]:
df.loc["735 Dolores St":"332 Hill St"]

,ID,City,State,Country,Name,Employees
Address,,,,,,
735 Dolores St,2,San Francisco,CA 94119,USA,Bready Shop,15
332 Hill St,3,San Francisco,California 94114,USA,Super River,25

+ 원하는 인덱스를 리스트로 구성

In [33]:
df.loc[["3666 21st St","332 Hill St"]]

,ID,City,State,Country,Name,Employees
Address,,,,,,
3666 21st St,1,San Francisco,CA 94114,USA,Madeira,8
332 Hill St,3,San Francisco,California 94114,USA,Super River,25

### 모든 행의 Country 칼럼

In [19]:
df.loc[:, "Country"]

Address
3666 21st St      USA
735 Dolores St    USA
332 Hill St       USA
Name: Country, dtype: object

### 결과값 리스트 저장

In [26]:
list(df.loc[:, "Country"])

['USA', 'USA', 'USA']

### iloc는 행번호를 입력

+ 행번호 2번

In [35]:
df.iloc[2]

ID                          3
City            San Francisco
State        California 94114
Country                   USA
Name              Super River
Employees                  25
Name: 332 Hill St, dtype: object

+ 행번호 0번과 2번

In [37]:
df.iloc[[0,2]]

,ID,City,State,Country,Name,Employees
Address,,,,,,
3666 21st St,1,San Francisco,CA 94114,USA,Madeira,8
332 Hill St,3,San Francisco,California 94114,USA,Super River,25

+ 행번호 1번에서 2번까지, 열번호 1번에서 3번까지

In [29]:
df.iloc[1:3, 1:4]

                         City             State Country
Address
735 Dolores St  San Francisco          CA 94119     USA
332 Hill St     San Francisco  California 94114     USA

+ 모든 행의 열번호 1번부터 3번까지

In [30]:
df.iloc[:, 1:4]

                         City             State Country
Address
3666 21st St    San Francisco          CA 94114     USA
735 Dolores St  San Francisco          CA 94119     USA
332 Hill St     San Francisco  California 94114     USA